app/views/tickets/show.html.erb

SELECT "assets".* FROM "assets" WHERE "assets"."ticket_id" = $1  [["ticket_id", 1]]
---

  <% if @ticket.assets.present? %>