app/views/projects/show.html.erb

<ul>
  <%= @project.tickets.each do |ticket| %>
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."project_id" = $1  [["project_id", 1]]