app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)

    if @project.save
---
INSERT INTO "projects" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "TextMate 2"], ["description", "A text-editor for OS X"], ["created_at", "2015-03-30 21:53:34.709139"], ["updated_at", "2015-03-30 21:53:34.709139"]]

  def update

    if @project.update(project_params)
---
UPDATE "projects" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "projects"."id" = $4  [["name", "TextMate 2 beta"], ["description", ""], ["updated_at", "2015-03-31 20:57:44.097848"], ["id", 37]]

  def destroy

    @project.destroy
---
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 75]]

  def set_project
    @project = Project.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 75]]