app/controllers/tickets_controller.rb

INSERT INTO "tickets" ("title", "description", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Non-standards compliance"], ["description", "My pages are ugly!"], ["project_id", 35], ["created_at", "2015-04-01 23:49:02.727596"], ["updated_at", "2015-04-01 23:49:02.727596"]]
---
  def create
    @ticket = @project.tickets.build(ticket_params)
    @ticket.user = current_user

    if @ticket.save

UPDATE "tickets" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "tickets"."id" = $4  [["title", "Make it really shiny!"], ["description", "\nAn example ticket, noting more"], ["updated_at", "2015-04-02 17:33:43.994562"], ["id", 26]]
---
  def update
    if @ticket.update(ticket_params)

DELETE FROM "tickets" WHERE "tickets"."id" = $1  [["id", 41]]
---
  def destroy
    @ticket.destroy

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 158]]
---
    def set_project
      @project = Project.for(current_user).find(params[:project_id])

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."project_id" = $1 AND "tickets"."id" = $2 LIMIT 1  [["project_id", 158], ["id", 32]]
---
    def set_ticket
      @ticket = @project.tickets.find(params[:id])