app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", ""], ["password_digest", "$2a$04$Vg7U3TgnB34tVIHP0X1CxORw3UrG71GcYRQ73pXlvyBVL8ALuVba2"], ["created_at", "2015-04-02 18:55:46.813974"], ["updated_at", "2015-04-02 18:55:46.813974"]]
---
  def create
    @user = User.new(user_params)

    if @user.save

UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "new_username"], ["updated_at", "2015-04-02 20:05:35.627067"], ["id", 75]]
---
  def update
    if @user.update(user_params)